test_case/fio_log/filldisk.log
fio: this platform does not support process shared mutexes, forcing use of threads. Use the 'thread' option to get rid of this warning.
seqwrite: (g=0): rw=write, bs=(R) 128KiB-128KiB, (W) 128KiB-128KiB, (T) 128KiB-128KiB, ioengine=windowsaio, iodepth=1
fio-3.38
Starting 1 thread
seqwrite: Laying out IO file (1 file / 228867MiB)

seqwrite: (groupid=0, jobs=1): err= 0: pid=324: Thu Jan 2 15:41:55 2025
  read: IOPS=1714, BW=214MiB/s (225MB/s)(224GiB/1067716msec)
    slat (nsec): min=1445, max=12558k, avg=5691.30, stdev=12696.89
    clat (usec): min=298, max=1018.5k, avg=353.02, stdev=1062.95
     lat (usec): min=300, max=1018.5k, avg=358.71, stdev=1063.27
    clat percentiles (usec):
     |  1.00th=[  314],  5.00th=[  318], 10.00th=[  318], 20.00th=[  322],
     | 30.00th=[  326], 40.00th=[  330], 50.00th=[  355], 60.00th=[  359],
     | 70.00th=[  359], 80.00th=[  363], 90.00th=[  371], 95.00th=[  383],
     | 99.00th=[  668], 99.50th=[  750], 99.90th=[ 2024], 99.95th=[ 2442],
     | 99.99th=[ 3064]
  write: IOPS=3876, BW=485MiB/s (508MB/s)(224GiB/472337msec); 0 zone resets
    slat (usec): min=225, max=23241, avg=251.17, stdev=38.40
    clat (nsec): min=43, max=1011.2M, avg=6448.04, stdev=750346.17
     lat (usec): min=239, max=1011.4k, avg=257.62, stdev=751.42
    clat percentiles (usec):
     |  1.00th=[    3],  5.00th=[    3], 10.00th=[    3], 20.00th=[    3],
     | 30.00th=[    3], 40.00th=[    4], 50.00th=[    4], 60.00th=[    4],
     | 70.00th=[    5], 80.00th=[    5], 90.00th=[    6], 95.00th=[    7],
     | 99.00th=[   10], 99.50th=[   14], 99.90th=[  474], 99.95th=[ 2114],
     | 99.99th=[ 2311]
   bw (  KiB/s): min=96000, max=513024, per=100.00%, avg=496968.51, stdev=19289.46, samples=944
   iops        : min=  750, max= 4008, avg=3882.17, stdev=150.70, samples=944
  lat (nsec)   : 50=0.01%, 100=0.01%, 250=0.02%, 500=0.01%, 750=0.01%
  lat (nsec)   : 1000=0.01%
  lat (usec)   : 2=0.04%, 4=34.42%, 10=15.07%, 20=0.18%, 50=0.08%
  lat (usec)   : 100=0.06%, 250=0.01%, 500=49.20%, 750=0.60%, 1000=0.16%
  lat (msec)   : 2=0.03%, 4=0.08%, 10=0.01%, 20=0.01%, 50=0.01%
  lat (msec)   : 2000=0.01%
  cpu          : usr=54.28%, sys=2.60%, ctx=0, majf=0, minf=0
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=1830943,1830943,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=214MiB/s (225MB/s), 214MiB/s-214MiB/s (225MB/s-225MB/s), io=224GiB (240GB), run=1067716-1067716msec
  WRITE: bw=485MiB/s (508MB/s), 485MiB/s-485MiB/s (508MB/s-508MB/s), io=224GiB (240GB), run=472337-472337msec