test_case/fio_log/seqwrite.log
fio: this platform does not support process shared mutexes, forcing use of threads. Use the 'thread' option to get rid of this warning.
seqwrite: (g=0): rw=write, bs=(R) 128KiB-128KiB, (W) 128KiB-128KiB, (T) 128KiB-128KiB, ioengine=windowsaio, iodepth=1
fio-3.38
Starting 1 thread
seqwrite: Laying out IO file (1 file / 10240MiB)

seqwrite: (groupid=0, jobs=1): err= 0: pid=8732: Mon Apr 7 20:36:26 2025
  write: IOPS=5507, BW=688MiB/s (722MB/s)(10.0GiB/14874msec); 0 zone resets
    slat (usec): min=3, max=417, avg=58.74, stdev=35.93
    clat (nsec): min=39, max=4615.6k, avg=121889.06, stdev=546069.51
     lat (usec): min=16, max=4639, avg=180.63, stdev=539.84
    clat percentiles (usec):
     |  1.00th=[    3],  5.00th=[    3], 10.00th=[    3], 20.00th=[    4],
     | 30.00th=[    4], 40.00th=[   13], 50.00th=[   14], 60.00th=[   15],
     | 70.00th=[   16], 80.00th=[   17], 90.00th=[   20], 95.00th=[   55],
     | 99.00th=[ 2868], 99.50th=[ 2966], 99.90th=[ 3490], 99.95th=[ 3556],
     | 99.99th=[ 3720]
   bw (  KiB/s): min=269025, max=5036032, per=98.78%, avg=696394.47, stdev=923396.84, samples=30
   iops        : min= 2101, max=39344, avg=5440.20, stdev=7214.06, samples=30
  lat (nsec)   : 50=0.01%, 100=0.01%, 250=0.01%, 500=0.04%, 750=0.02%
  lat (nsec)   : 1000=0.01%
  lat (usec)   : 2=0.01%, 4=33.14%, 10=4.74%, 20=52.71%, 50=3.91%
  lat (usec)   : 100=1.28%, 250=0.15%, 500=0.02%, 750=0.01%
  lat (msec)   : 2=0.01%, 4=3.93%, 10=0.01%
  cpu          : usr=0.00%, sys=26.89%, ctx=0, majf=0, minf=0
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,81920,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=688MiB/s (722MB/s), 688MiB/s-688MiB/s (722MB/s-722MB/s), io=10.0GiB (10.7GB), run=14874-14874msec